
def area(a: int) -> int:
    '''
    Принимает длину стороны квадрата, возвращает его площадь.

        Параметр:
            a (int): длина стороны (целое число)

        Возвращаемое значение:
            square (int): площадь квадрата
    '''
    return a * a


def perimeter(a: int) -> int:
    '''
    Принимает длину стороны квадрата, возвращает его периметр.

        Параметр:
            a (int): длина стороны (целое число)

        Возвращаемое значение:
            perimeter (int): периметер квадрата
    '''
    return 4 * a
